<a href="https://colab.research.google.com/github/Medgoby/Article-summarization/blob/master/My_Data_Quality.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
pd.__version__

'1.1.5'

In [ ]:
list=[62,1,-5,34]
min=[0]
for e in list: 
  if e < min :
    min=e
print(min)

TypeError: ignored

## Lecture des fichiers

In [ ]:
filepath='https://bit.ly/world-cities-clean'

In [ ]:
print(filepath)

https://bit.ly/world-cities-clean

In [ ]:
df=pd.read_csv(filepath)
df.sample(5)

           name        country  subcountry  geonameid
19377    Igunga       Tanzania      Tabora     159386
6540       Batī       Ethiopia      Amhara     342641
21951  Rosamond  United States  California    5388735
13195     Merke     Kazakhstan     Zhambyl    1520969
19120  İstanbul         Turkey    Istanbul     745044

In [ ]:
fp='https://bit.ly/world-cities-dirty-v2'

In [ ]:
print(fp)

https://bit.ly/world-cities-dirty-v2

In [ ]:
df=pd.read_csv(fp)
df.sample(5)

                                                             Lorem ipsum dolor sit amet  ...  sunt in culpa qui officia deserunt mollit anim id est laborum.
South Jordan Heights United States Utah      5781765 NaN NaN                        NaN  ...                                                NaN
Eltville             Germany       Hesse     2930646 NaN NaN                        NaN  ...                                                NaN
Maarssen             Netherlands   Utrecht   2751316 NaN NaN                        NaN  ...                                                NaN
Gurupi               Brazil        Tocantins 3461724 NaN NaN                        NaN  ...                                                NaN
Mahanje              Tanzania      Ruvuma    155285  NaN NaN                        NaN  ...                                                NaN

[5 rows x 5 columns]

In [ ]:
df=pd.read_csv(fp,
               skiprows=2, #enlève les deux prémières lignes
               skipfooter=1) #enlève la dernière ligne
df.sample(5)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

                name        country  subcountry  geonameid
22296   Frederickson  United States  Washington    5795011
11171         Mohali          India      Punjab    6992326
5298    Altglienicke        Germany      Berlin    2957185
20862       Wheeling  United States    Illinois    4916311
16527  Torres Vedras       Portugal      Lisbon    2262581

In [ ]:
df.shape

(23018, 4)

In [ ]:
fp='https://bit.ly/world-cities-dirty-v3'
print(fp)

https://bit.ly/world-cities-dirty-v3

In [ ]:
df=pd.read_csv(fp, names=['names','country','subcountry','geonameid'],
               sep='|')
df.head()

              names               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

In [ ]:
fp='https://bit.ly/bitcoin-data'
print(fp)

https://bit.ly/bitcoin-data

In [ ]:
df=pd.read_csv(fp,
               skipfooter=2) 
df.sample(5)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.

           Date    Open*     High      Low  Close**       Volume    Market Cap
25  Dec 20 2019  7208.64  7257.92  7086.12  7218.82  22633815180  130752796980
14  Dec 31 2019  7294.44  7335.29  7169.78  7193.60  21167946112  130446112598
16  Dec 29 2019  7317.65  7513.95  7279.87  7422.65  22445257702  134570835775
28  Dec 17 2019  6931.32  6964.07  6587.97  6640.52  22363804217  120234244809
7   Jan 07 2020  7768.68  8178.22  7768.23  8163.69  28767291327  148152237654

In [ ]:
df.isna().sum()

Date          0
Open*         0
High          0
Low           0
Close**       0
Volume        0
Market Cap    0
dtype: int64

In [ ]:
df.rename(columns={'Open*':'Open', 'Close**':'Close'}, inplace=True)
df.head()

          Date     Open     High      Low    Close       Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [ ]:
#Création d'une fonction permettant de remplacer les espaces par un tirêt du 8
def SansEspace (s):
  return s.replace (' ', '_')

In [ ]:
#Essayer la fonction
SansEspace('Barry Mohamed')

'Barry_Mohamed'

In [ ]:
#Appliquer sur le DataFrame
df.rename(SansEspace,
          axis='columns')

           Date     Open     High      Low    Close       Volume    Market_Cap
0   Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1   Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2   Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3   Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4   Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277
5   Jan 09 2020  8082.30  8082.30  7842.40  7879.07  24045990466  143016572819
6   Jan 08 2020  8161.94  8396.74  7956.77  8079.86  31672559265  146645162431
7   Jan 07 2020  7768.68  8178.22  7768.23  8163.69  28767291327  148152237654
8   Jan 06 2020  7410.45  7781.87  7409.29  7769.22  23276261598  140976457304
9   Jan 05 2020  7410.45  7544.50  7400.54  7411.32  19725074095  134469548249
10  Jan 04 2020  7345.38  7427.39  7309.51  7410.66  18444271275  134442464030
11  Jan 03 2020  6984.43  7413.72  6915.00  7344.88  28111481032  133233444755
12  Jan 02 2020  7202.55  7212.16  6935.27  6985.47  20802083465  126699395235
13  Jan 01 2020  7194.89  7254.33  7174.94  7200.17  18565664997  130580829150
14  Dec 31 2019  7294.44  7335.29  7169.78  7193.60  21167946112  130446112598
15  Dec 30 2019  7420.27  7454.82  7276.31  7293.00  22874131672  132235128152
16  Dec 29 2019  7317.65  7513.95  7279.87  7422.65  22445257702  134570835775
17  Dec 28 2019  7289.03  7399.04  7286.91  7317.99  21365673026  132659059740
18  Dec 27 2019  7238.14  7363.53  7189.93  7290.09  22777360996  132139502950
19  Dec 26 2019  7274.80  7388.30  7200.39  7238.97  22787010034  131200030100
20  Dec 25 2019  7325.76  7357.02  7220.99  7275.16  21559505149  131840641292
21  Dec 24 2019  7354.39  7535.72  7269.53  7322.53  22991622105  132687583295
22  Dec 23 2019  7508.90  7656.18  7326.19  7355.63  27831788041  133275709111
23  Dec 22 2019  7191.19  7518.03  7167.18  7511.59  23134537956  136088022049
24  Dec 21 2019  7220.59  7223.23  7112.74  7191.16  19312552168  130267655889
25  Dec 20 2019  7208.64  7257.92  7086.12  7218.82  22633815180  130752796980
26  Dec 19 2019  7277.59  7346.60  7041.38  7202.84  25904604416  130445758713
27  Dec 18 2019  6647.70  7324.98  6540.05  7276.80  31836522778  131754969804
28  Dec 17 2019  6931.32  6964.07  6587.97  6640.52  22363804217  120234244809
29  Dec 16 2019  7153.66  7171.17  6903.68  6932.48  20213265950  125515586952
30  Dec 15 2019  7124.24  7181.08  6924.38  7152.30  16881129804  129481424648

In [ ]:
df.drop('Volume',
        axis='columns')

           Date     Open     High      Low    Close    Market Cap
0   Jan 14 2020  8140.93  8879.51  8140.93  8827.76  160319484883
1   Jan 13 2020  8189.77  8197.79  8079.70  8144.19  147890525973
2   Jan 12 2020  8033.26  8200.06  8009.06  8192.49  148752956966
3   Jan 11 2020  8162.19  8218.36  8029.64  8037.54  145924199942
4   Jan 10 2020  7878.31  8166.55  7726.77  8166.55  148249907277
5   Jan 09 2020  8082.30  8082.30  7842.40  7879.07  143016572819
6   Jan 08 2020  8161.94  8396.74  7956.77  8079.86  146645162431
7   Jan 07 2020  7768.68  8178.22  7768.23  8163.69  148152237654
8   Jan 06 2020  7410.45  7781.87  7409.29  7769.22  140976457304
9   Jan 05 2020  7410.45  7544.50  7400.54  7411.32  134469548249
10  Jan 04 2020  7345.38  7427.39  7309.51  7410.66  134442464030
11  Jan 03 2020  6984.43  7413.72  6915.00  7344.88  133233444755
12  Jan 02 2020  7202.55  7212.16  6935.27  6985.47  126699395235
13  Jan 01 2020  7194.89  7254.33  7174.94  7200.17  130580829150
14  Dec 31 2019  7294.44  7335.29  7169.78  7193.60  130446112598
15  Dec 30 2019  7420.27  7454.82  7276.31  7293.00  132235128152
16  Dec 29 2019  7317.65  7513.95  7279.87  7422.65  134570835775
17  Dec 28 2019  7289.03  7399.04  7286.91  7317.99  132659059740
18  Dec 27 2019  7238.14  7363.53  7189.93  7290.09  132139502950
19  Dec 26 2019  7274.80  7388.30  7200.39  7238.97  131200030100
20  Dec 25 2019  7325.76  7357.02  7220.99  7275.16  131840641292
21  Dec 24 2019  7354.39  7535.72  7269.53  7322.53  132687583295
22  Dec 23 2019  7508.90  7656.18  7326.19  7355.63  133275709111
23  Dec 22 2019  7191.19  7518.03  7167.18  7511.59  136088022049
24  Dec 21 2019  7220.59  7223.23  7112.74  7191.16  130267655889
25  Dec 20 2019  7208.64  7257.92  7086.12  7218.82  130752796980
26  Dec 19 2019  7277.59  7346.60  7041.38  7202.84  130445758713
27  Dec 18 2019  6647.70  7324.98  6540.05  7276.80  131754969804
28  Dec 17 2019  6931.32  6964.07  6587.97  6640.52  120234244809
29  Dec 16 2019  7153.66  7171.17  6903.68  6932.48  125515586952
30  Dec 15 2019  7124.24  7181.08  6924.38  7152.30  129481424648

In [ ]:
#df.drop_duplicates
#df.dropna
#df.rename(str.lower, axis='columns')
#df_copy=df.copy(deep=True)

In [ ]:
fp='https://bit.ly/bitcoin-purchases'
print(fp)

https://bit.ly/bitcoin-purchases

In [ ]:
df=pd.read_csv(fp)
df.head()

                      bitcoin address wire amount          credit card
0  1HeUNvQfhjn8afvjMrMEX5VQB5zy8AacXZ    $2268.82  6759241310493014168
1  18xA8uEzQsEQpyfJWrrLmnu72ut7p2GgeU    $4590.27     6394078189900621
2  1CPLebXd6VKdEmD6xsVByYDbsyhkZ4XzrE    $6160.48     3539006321388994
3  1ESn9zPPwAExS98jqhjkDPd7tGeoevL42u    $6647.19     3560801557252993
4  1JLYsDExCUsEPrN6vNsEgJubJE4xqWtqhp    $3759.40     5349906235596126

In [ ]:
df.shape

(1000, 3)

In [ ]:
df.dtypes

bitcoin address    object
wire amount        object
credit card         int64
dtype: object

In [ ]:
#Suppression du sigle dollar
df['wire amount'].str.replace('$','')

0      2268.82
1      4590.27
2      6160.48
3      6647.19
4      3759.40
        ...
995    8777.99
996    7614.59
997    1710.21
998    5240.64
999    5672.95
Name: wire amount, Length: 1000, dtype: object

In [ ]:
df['wire amount'].str.replace('$','').astype(float)

0      2268.82
1      4590.27
2      6160.48
3      6647.19
4      3759.40
        ...
995    8777.99
996    7614.59
997    1710.21
998    5240.64
999    5672.95
Name: wire amount, Length: 1000, dtype: float64

In [ ]:
df['wire amount']=df['wire amount'].str.replace('$','').astype(float)

In [ ]:
df.dtypes

bitcoin address     object
wire amount        float64
credit card          int64
dtype: object

In [ ]:
fp='https://bit.ly/bitcoin-purchases2'
print(fp)

https://bit.ly/bitcoin-purchases2

In [ ]:
df=pd.read_csv(fp)
df.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311,06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032,44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592

In [ ]:
df.tail()

                        bitcoin address wire amount          credit card
995  1Jmz4FMQENDkrtkivVdXM8SiC6ZCJVTDhp     ¥844.68     5541649583285688
996  1GCZKgPV9277czn1RsTYoubCwhbndUvPZU    €1433,63  6304232254235660027
997   1LK2DsWBUmSAsqg7n46sdgg4v2SNrqEPM    €3814,11     3546750658508135
998  1PD6oNfFEnxMsR1PvUvkjHQdHYLCewLJhq    $2900.85  6333272716093574938
999  1B2vk6p7usuV4dfrBMLo8Rzpb5NatTmE8R    $1587.16     4913614335644981

In [ ]:
#Remplacer les virgules par des points
df['wire amount']=df['wire amount'].str.replace(',','.')

In [ ]:
#Supression du symbole de la devise dans la colonne wire amount 
df['wire amount'].str.slice(1)

0      8356.92
1       311,06
2      2032,44
3      8155.74
4      3265.44
        ...
995     844.68
996    1433,63
997    3814,11
998    2900.85
999    1587.16
Name: wire amount, Length: 1000, dtype: object

In [ ]:
df.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311.06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032.44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592

In [ ]:
df['wire amount']=df['wire amount'].str.replace('$','').astype(float)
df['wire amount']=df['wire amount'].str.replace('£','').astype(float)
df['wire amount']=df['wire amount'].str.replace('€','').astype(float)
df['wire amount']=df['wire amount'].str.replace('¥','').astype(float)

In [ ]:
#Création d'une colonne currency par les fonctions get ou slice
df['wire amount'].str.get(0)

0      £
1      €
2      €
3      ¥
4      £
      ..
995    ¥
996    €
997    €
998    $
999    $
Name: wire amount, Length: 1000, dtype: object

In [ ]:
df['wire amount'].str.slice(stop=1)

0      £
1      €
2      €
3      ¥
4      £
      ..
995    ¥
996    €
997    €
998    $
999    $
Name: wire amount, Length: 1000, dtype: object

In [ ]:
df['currency']=df['wire amount'].str.get(0)
df.head()

                      bitcoin address wire amount       credit card currency
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398        £
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311.06  3584615208479876        €
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032.44  6370577480710876        €
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398        ¥
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592        £

In [ ]:
df['currency']=df['wire amount'].str.slice(stop=1)
df.head()

                      bitcoin address wire amount       credit card currency
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398        £
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311.06  3584615208479876        €
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032.44  6370577480710876        €
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398        ¥
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592        £

In [ ]:
df['wire amount'].str.slice(1,None).astype(float)

0      8356.92
1       311.06
2      2032.44
3      8155.74
4      3265.44
        ...
995     844.68
996    1433.63
997    3814.11
998    2900.85
999    1587.16
Name: wire amount, Length: 1000, dtype: float64

In [ ]:
df['wire amount']=df['wire amount'].str.slice(1).astype(float)
df.head()

                      bitcoin address  wire amount       credit card currency
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe      8356.92  3543456448666398        £
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q       311.06  3584615208479876        €
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP      2032.44  6370577480710876        €
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6      8155.74  4508652385157398        ¥
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ      3265.44   374622922103592        £

In [ ]:
fp='https://bit.ly/felonies-dataset'
print(fp)

https://bit.ly/felonies-dataset

In [ ]:
df=pd.read_csv(fp)
df.head()

        Date of Arrest  Age Convicted
0  2014-07-16 14:59:18   77       Yes
1  2002-12-19 22:17:59   28       Yes
2  1994-06-28 09:31:40   21        No
3  1985-05-14 09:52:17   45       Yes
4  1985-05-25 14:06:28   39       Yes

In [ ]:
df.dtypes

Date of Arrest    object
Age                int64
Convicted         object
dtype: object

In [ ]:
df['Age'].describe()

count    1000.000000
mean       54.605000
std        25.225172
min        10.000000
25%        33.000000
50%        53.000000
75%        76.000000
max        99.000000
Name: Age, dtype: float64

In [ ]:
#Recoder la date enfant 0-13, Adol 14-20, Adult 21-65, Seniors +65
pd.cut(df['Age'],
       bins=[9,13,20,65,100],
       labels=['Child','Ado','Adult','Senior'])

0      Senior
1       Adult
2       Adult
3       Adult
4       Adult
        ...
995    Senior
996    Senior
997    Senior
998     Adult
999     Adult
Name: Age, Length: 1000, dtype: category
Categories (4, object): ['Child' < 'Ado' < 'Adult' < 'Senior']

In [ ]:
prefix=['ten','twent','thir','four','fif','six','seven','eigh','nine',]
for i, prefix in enumerate(prefix):
  age=(i+1)*10
  categoryName=prefix+'ties'
  print(f'* De {age} à {age+9} ans => {categoryName}')

* De 10 à 19 ans => tenties
* De 20 à 29 ans => twentties
* De 30 à 39 ans => thirties
* De 40 à 49 ans => fourties
* De 50 à 59 ans => fifties
* De 60 à 69 ans => sixties
* De 70 à 79 ans => seventies
* De 80 à 89 ans => eighties
* De 90 à 99 ans => nineties

 De 10 à 19 ans => tenties
* De 20 à 29 ans => twentties
* De 30 à 39 ans => thirties
* De 40 à 49 ans => fourties
* De 50 à 59 ans => fifties
* De 60 à 69 ans => sixties
* De 70 à 79 ans => seventies
* De 80 à 89 ans => eighties
* De 90 à 99 ans => nineties

In [ ]:
# A dure
df['Date of Arrest'].str.slice(0,4)

0      2014
1      2002
2      1994
3      1985
4      1985
       ...
995    1992
996    1996
997    1980
998    1999
999    1996
Name: Date of Arrest, Length: 1000, dtype: object

In [ ]:
df['Year']=df['Date of Arrest'].str.slice(0,4).astype(int)
df['Month']=df['Date of Arrest'].str.slice(5,7).astype(int)
df['Day']=df['Date of Arrest'].str.slice(8,10).astype(int)
df['Hours']=df['Date of Arrest'].str.slice(11,13).astype(int)
df['Minutes']=df['Date of Arrest'].str.slice(14,16).astype(int)
df['Secondes']=df['Date of Arrest'].str.slice(17,19).astype(int)
df.head()

        Date of Arrest  Age Convicted  Year  ...  Day  Hours  Minutes  Secondes
0  2014-07-16 14:59:18   77       Yes  2014  ...   16     14       59        18
1  2002-12-19 22:17:59   28       Yes  2002  ...   19     22       17        59
2  1994-06-28 09:31:40   21        No  1994  ...   28      9       31        40
3  1985-05-14 09:52:17   45       Yes  1985  ...   14      9       52        17
4  1985-05-25 14:06:28   39       Yes  1985  ...   25     14        6        28

[5 rows x 9 columns]

In [ ]:
# a la coo
#consiste à caster le type str dans notre champ date en type datetime
pd.to_datetime(df['Date of Arrest'])

0     2014-07-16 14:59:18
1     2002-12-19 22:17:59
2     1994-06-28 09:31:40
3     1985-05-14 09:52:17
4     1985-05-25 14:06:28
              ...
995   1992-02-04 14:24:25
996   1996-04-29 18:03:23
997   1980-07-15 21:59:27
998   1999-07-05 17:16:12
999   1996-03-17 18:29:25
Name: Date of Arrest, Length: 1000, dtype: datetime64[ns]

In [ ]:
df['Date of Arrest']=pd.to_datetime(df['Date of Arrest'])
df.dtypes

Date of Arrest    datetime64[ns]
Age                        int64
Convicted                 object
dtype: object

In [ ]:
#df.drop(['Year','Day','Hours','Month','Minutes','Secondes'],axis=1,inplace=True)

In [ ]:
df['Date of Arrest'].dt.date

0      2014-07-16
1      2002-12-19
2      1994-06-28
3      1985-05-14
4      1985-05-25
          ...
995    1992-02-04
996    1996-04-29
997    1980-07-15
998    1999-07-05
999    1996-03-17
Name: Date of Arrest, Length: 1000, dtype: object

In [ ]:
df['Date of Arrest'].dt.month

0       7
1      12
2       6
3       5
4       5
       ..
995     2
996     4
997     7
998     7
999     3
Name: Date of Arrest, Length: 1000, dtype: int64

In [ ]:
df['Date of Arrest'].dt.day

0      16
1      19
2      28
3      14
4      25
       ..
995     4
996    29
997    15
998     5
999    17
Name: Date of Arrest, Length: 1000, dtype: int64

In [ ]:
df['Date of Arrest'].dt.time

0      14:59:18
1      22:17:59
2      09:31:40
3      09:52:17
4      14:06:28
         ...
995    14:24:25
996    18:03:23
997    21:59:27
998    17:16:12
999    18:29:25
Name: Date of Arrest, Length: 1000, dtype: object

In [ ]:
df['Date of Arrest'].dt.dayofweek

0      2
1      3
2      1
3      1
4      5
      ..
995    1
996    0
997    1
998    0
999    6
Name: Date of Arrest, Length: 1000, dtype: int64

In [ ]:
df['Date of Arrest'].dt.day_name()

0      Wednesday
1       Thursday
2        Tuesday
3        Tuesday
4       Saturday
         ...
995      Tuesday
996       Monday
997      Tuesday
998       Monday
999       Sunday
Name: Date of Arrest, Length: 1000, dtype: object

In [ ]:
df['Date of Arrest'].dt.month_name()

0          July
1      December
2          June
3           May
4           May
         ...
995    February
996       April
997        July
998        July
999       March
Name: Date of Arrest, Length: 1000, dtype: object

In [ ]:
df['Date of Arrest'].dt.year

0      2014
1      2002
2      1994
3      1985
4      1985
       ...
995    1992
996    1996
997    1980
998    1999
999    1996
Name: Date of Arrest, Length: 1000, dtype: int64

# Extraire de l'information categorielle depuis des dates

In [ ]:
fp='https://bit.ly/felonies-dataset'
print(fp)

https://bit.ly/felonies-dataset

In [ ]:
df=pd.read_csv(fp)
df.head()

        Date of Arrest  Age Convicted
0  2014-07-16 14:59:18   77       Yes
1  2002-12-19 22:17:59   28       Yes
2  1994-06-28 09:31:40   21        No
3  1985-05-14 09:52:17   45       Yes
4  1985-05-25 14:06:28   39       Yes

In [ ]:
df.dtypes

Date of Arrest    object
Age                int64
Convicted         object
dtype: object

In [ ]:
df['Date of Arrest']=pd.to_datetime(df['Date of Arrest'])
df.dtypes

Date of Arrest    datetime64[ns]
Age                        int64
Convicted                 object
dtype: object

In [ ]:
from datetime import datetime

In [ ]:
datetime(year=1999,
         month=1,
         day=1)

datetime.datetime(1999, 1, 1, 0, 0)

In [ ]:
def year(y):
  return datetime(year=1999,month=1, day=1)

In [ ]:
year=lambda y: datetime(year=1999,month=1, day=1)

year(2030)

datetime.datetime(1999, 1, 1, 0, 0)

In [ ]:
df['Date of Arrest'].describe()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  """Entry point for launching an IPython kernel.

count                    1000
unique                   1000
top       2012-09-17 23:04:27
freq                        1
first     1968-01-10 02:41:49
last      2020-01-28 13:33:46
Name: Date of Arrest, dtype: object

In [ ]:
print_data=lambda dt : dt.strftime('%d %b %Y')

print_data(year(1990))

'01 Jan 1999'

In [ ]:
labels=[f'Periode {i+1}' for i in range(4)]

In [ ]:
pd.cut(df['Date of Arrest'],
       bins=[year(1968),
             year(1975),
             year(1998),
             year(2010),
             year(2021)],
       labels=labels)

ValueError: ignored

# Objectif
### *Lundi, Mardi = Debut de semaine
### *Mercredi, Jeudi, Vendredi = Milieu de semaine
### *Samedi, dimanche= Week-End

In [ ]:
df['Date of Arrest']=pd.to_datetime(df['Date of Arrest'])
df.dtypes

Date of Arrest    datetime64[ns]
Age                        int64
Convicted                 object
dtype: object

In [ ]:
df.rename({'Date of Arrest':'DoA'}, axis=1, inplace=True)

In [ ]:
df.head()

                  DoA  Age Convicted
0 2014-07-16 14:59:18   77       Yes
1 2002-12-19 22:17:59   28       Yes
2 1994-06-28 09:31:40   21        No
3 1985-05-14 09:52:17   45       Yes
4 1985-05-25 14:06:28   39       Yes

In [ ]:
df['DoA'].dt.dayofweek

0      2
1      3
2      1
3      1
4      5
      ..
995    1
996    0
997    1
998    0
999    6
Name: DoA, Length: 1000, dtype: int64

In [ ]:
day_list=['Monday', 'Tuesday','Wednesday','Thursday', 'Fraiday','Saturday','Sunday']

In [ ]:
day_list[0]

'Monday'

In [ ]:
day_list[6]

'Sunday'

In [ ]:
id2day={i:s for i,s in enumerate(day_list) }
day2id={s:i for i,s in enumerate(day_list) }

In [ ]:
id2day[0]

'Monday'

In [ ]:
day2id['Monday']

0

## Methode 1 : pd.cut

In [ ]:
from_monday=day2id['Monday']-1

In [ ]:
pd.cut(df['DoA'],
       bins=[from_monday,
             day2id['Tuesday'],
             day2id['Fraiday'],
             day2id['Sunday']],
       labels=['WeekStart','WeekMiddle','WeekEnd'])

ValueError: ignored

In [ ]:
pd.cut(df['DoA'].dt.dayofweek,
       bins=[from_monday,
             day2id['Tuesday'],
             day2id['Fraiday'],
             day2id['Sunday']],
       labels=['WeekStart','WeekMiddle','WeekEnd'])

0      WeekMiddle
1      WeekMiddle
2       WeekStart
3       WeekStart
4         WeekEnd
          ...
995     WeekStart
996     WeekStart
997     WeekStart
998     WeekStart
999       WeekEnd
Name: DoA, Length: 1000, dtype: category
Categories (3, object): ['WeekStart' < 'WeekMiddle' < 'WeekEnd']

In [ ]:
df['Week_Periode']=pd.cut(df['DoA'].dt.dayofweek,
                          bins=[from_monday,
                                day2id['Tuesday'],
                                day2id['Fraiday'],
                                day2id['Sunday']],
                          labels=['WeekStart','WeekMiddle','WeekEnd'])
df.head()

                  DoA  Age Convicted Week_Periode  DayOfWeek
0 2014-07-16 14:59:18   77       Yes   WeekMiddle  Wednesday
1 2002-12-19 22:17:59   28       Yes   WeekMiddle   Thursday
2 1994-06-28 09:31:40   21        No    WeekStart    Tuesday
3 1985-05-14 09:52:17   45       Yes    WeekStart    Tuesday
4 1985-05-25 14:06:28   39       Yes      WeekEnd   Saturday

In [ ]:
df['DayOfWeek']=df['DoA'].dt.dayofweek.map(id2day)
df.head()

                  DoA  Age Convicted Week_Periode  DayOfWeek
0 2014-07-16 14:59:18   77       Yes   WeekMiddle  Wednesday
1 2002-12-19 22:17:59   28       Yes   WeekMiddle   Thursday
2 1994-06-28 09:31:40   21        No    WeekStart    Tuesday
3 1985-05-14 09:52:17   45       Yes    WeekStart    Tuesday
4 1985-05-25 14:06:28   39       Yes      WeekEnd   Saturday

### Methode 2 : Double map

In [ ]:
day2id

{'Fraiday': 4,
 'Monday': 0,
 'Saturday': 5,
 'Sunday': 6,
 'Thursday': 3,
 'Tuesday': 1,
 'Wednesday': 2}

In [ ]:
day2category={'Fraiday': 'WeekMiddle',
 'Monday': 'WeekStart',
 'Saturday': 'WeekEnd',
 'Sunday': 'WeekEnd',
 'Thursday': 'WeekMiddle',
 'Tuesday': 'WeekStart',
 'Wednesday': 'WeekMiddle'}

In [ ]:
df['DoA'].dt.dayofweek.map(id2day).map(day2category)

0      WeekMiddle
1      WeekMiddle
2       WeekStart
3       WeekStart
4         WeekEnd
          ...
995     WeekStart
996     WeekStart
997     WeekStart
998     WeekStart
999       WeekEnd
Name: DoA, Length: 1000, dtype: object

In [ ]:
df['Week_Periode2']=df['DoA'].dt.dayofweek.map(id2day).map(day2category)
df.head()

                  DoA  Age Convicted Week_Periode  DayOfWeek Week_Periode2
0 2014-07-16 14:59:18   77       Yes   WeekMiddle  Wednesday    WeekMiddle
1 2002-12-19 22:17:59   28       Yes   WeekMiddle   Thursday    WeekMiddle
2 1994-06-28 09:31:40   21        No    WeekStart    Tuesday     WeekStart
3 1985-05-14 09:52:17   45       Yes    WeekStart    Tuesday     WeekStart
4 1985-05-25 14:06:28   39       Yes      WeekEnd   Saturday       WeekEnd

### Objectif : creer une colonne categorielle 'Time of day'

#### *Morning entre 6h01 et 13
#### *Afternoon Entre 13h01  et 18h
#### *Evening Entre 18h01 et 22h 
#### *Night   Entre 22h01 et 6h 

#### Problème : Night

In [ ]:
df['DoA']=pd.to_datetime(df['DoA'])

In [ ]:
df['DoA'].dt.hour

0      14
1      22
2       9
3       9
4      14
       ..
995    14
996    18
997    21
998    17
999    18
Name: DoA, Length: 1000, dtype: int64

In [ ]:
df['DoA'].dt.hour.min()

0

In [ ]:
df['DoA'].dt.hour.max()

23

In [ ]:
FromMidnight=-1
tmp=pd.cut(df['DoA'].dt.hour,
           bins=[FromMidnight,
                 6,13,18,22,24],
           labels=['Night','Morning','Afternoon','Evening','Night1'])
tmp

0      Afternoon
1        Evening
2        Morning
3        Morning
4      Afternoon
         ...
995    Afternoon
996    Afternoon
997      Evening
998    Afternoon
999    Afternoon
Name: DoA, Length: 1000, dtype: category
Categories (5, object): ['Night' < 'Morning' < 'Afternoon' < 'Evening' < 'Night1']

In [ ]:
tmp.str.replace('1', '').astype('category')

0      Afternoon
1        Evening
2        Morning
3        Morning
4      Afternoon
         ...
995    Afternoon
996    Afternoon
997      Evening
998    Afternoon
999    Afternoon
Name: DoA, Length: 1000, dtype: category
Categories (5, object): ['Afternoon', 'Evening', 'Morning', 'Night', 'Night1']

In [ ]:
df['Time of Day']=tmp.str.replace('1', '').astype('category')
df.head()

                  DoA  Age Convicted  ...  DayOfWeek Week_Periode2 Time of Day
0 2014-07-16 14:59:18   77       Yes  ...  Wednesday    WeekMiddle   Afternoon
1 2002-12-19 22:17:59   28       Yes  ...   Thursday    WeekMiddle     Evening
2 1994-06-28 09:31:40   21        No  ...    Tuesday     WeekStart     Morning
3 1985-05-14 09:52:17   45       Yes  ...    Tuesday     WeekStart     Morning
4 1985-05-25 14:06:28   39       Yes  ...   Saturday       WeekEnd   Afternoon

[5 rows x 7 columns]

In [ ]:
dir(df['DoA'].dt)

['__annotations__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_accessors',
 '_add_delegate_accessors',
 '_constructor',
 '_delegate_method',
 '_delegate_property_get',
 '_delegate_property_set',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_freeze',
 '_get_values',
 '_reset_cache',
 'ceil',
 'date',
 'day',
 'day_name',
 'dayofweek',
 'dayofyear',
 'days_in_month',
 'daysinmonth',
 'floor',
 'freq',
 'hour',
 'is_leap_year',
 'is_month_end',
 'is_month_start',
 'is_quarter_end',
 'is_quarter_start',
 'is_year_end',
 'is_year_start',
 'isocalendar',
 'microsecond',
 'minute',
 'month',
 'month_name',
 'nanosecond',
 'normalize',
 'quarter',
 'round',
 'second',
 'strftime',
 'time',
 'timetz',
 'to_period',
 'to_pydatetime',
 'tz',
 'tz_convert',
 'tz_localize',
 'week',
 'weekday',
 'weekofyear',
 'year']

In [ ]:
df['DoA'].dt.month

0       7
1      12
2       6
3       5
4       5
       ..
995     2
996     4
997     7
998     7
999     3
Name: DoA, Length: 1000, dtype: int64

In [ ]:
df['DoA'].dt.day

0      16
1      19
2      28
3      14
4      25
       ..
995     4
996    29
997    15
998     5
999    17
Name: DoA, Length: 1000, dtype: int64

In [ ]:
cut=df['DoA'].dt.month*100 + df['DoA'].dt.day
cut

0       716
1      1219
2       628
3       514
4       525
       ...
995     204
996     429
997     715
998     705
999     317
Name: DoA, Length: 1000, dtype: int64

In [ ]:
bins=[100,320,620,920,1220, 1231]

In [ ]:
From_Jan_01=100
Mars_20=320
June_20=620
Sep_20=920
Dec_20=1220
Dec_31=1231

In [ ]:
tmp=pd.cut(cut,
           bins=[From_Jan_01,
                  Mars_20,
                  June_20,
                  Sep_20,
                  Dec_20,
                  Dec_31],
           labels=['Winter','String','Summer','Fall','Winter1'])

In [ ]:
tmp.str.replace('1', '').astype('category')

0      Summer
1        Fall
2      Summer
3      String
4      String
        ...
995    Winter
996    String
997    Summer
998    Summer
999    Winter
Name: DoA, Length: 1000, dtype: category
Categories (4, object): ['Fall', 'String', 'Summer', 'Winter']

In [ ]:
df['Season']=tmp.str.replace('1', '').astype('category')
df.head()

                  DoA  Age Convicted  ... Week_Periode2 Time of Day  Season
0 2014-07-16 14:59:18   77       Yes  ...    WeekMiddle   Afternoon  Summer
1 2002-12-19 22:17:59   28       Yes  ...    WeekMiddle     Evening    Fall
2 1994-06-28 09:31:40   21        No  ...     WeekStart     Morning  Summer
3 1985-05-14 09:52:17   45       Yes  ...     WeekStart     Morning  String
4 1985-05-25 14:06:28   39       Yes  ...       WeekEnd   Afternoon  String

[5 rows x 8 columns]

# Données Manquantes

In [ ]:
fp='https://bit.ly/tx-data'
print(fp)

https://bit.ly/tx-data

In [ ]:
import pandas as pd
df=pd.read_csv(fp)
df.head()

  transaction_id first_name  last_name       ip_address   amount
0      50563-403     Jacobo   Haresign    18.144.134.48  $647.77
1     54569-3911    Christy       Derl  254.107.123.242  $460.47
2     59667-0024     Florie     Prewer    148.80.11.233  $565.38
3      60429-123     Danika     Shimuk   233.91.221.158  $794.76
4      0187-0771   Annelise  Antonescu   238.143.41.105  $790.41

In [ ]:
df.tail()

   transaction_id first_name   last_name      ip_address   amount
43      0456-2212     Layney    Janssens    79.49.30.228  $889.27
44      59779-276   Lynnelle     Ainslie     38.85.34.83  $473.65
45      68712-049    Phaedra     Teodoro    92.45.204.14  $445.56
46     10157-9539    Sibylla      Pedron  207.112.216.80  $362.15
47      0378-1044   Sharlene  Wolfendale  32.253.106.253  $133.98

In [ ]:
df.dtypes

transaction_id    object
first_name        object
last_name         object
ip_address        object
amount            object
dtype: object

### Reperer les doublons

In [ ]:
df[df.duplicated()]

   transaction_id first_name   last_name       ip_address   amount
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

In [ ]:
df[df.duplicated(keep=False)]

   transaction_id first_name   last_name       ip_address   amount
2      59667-0024     Florie      Prewer    148.80.11.233  $565.38
5       53942-299      Upton        Emig  103.190.123.125  $759.53
7       60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
12      68180-751     Marlon      Fernie   61.133.100.141  $974.30
14      65862-207     Alvira      Heifer   141.170.128.72  $584.13
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
16      0066-0508       Jedd     Hartman     21.55.247.91  $749.96
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

In [ ]:
#En ciblant une colonne
df[df.duplicated(subset='transaction_id')]

   transaction_id first_name   last_name       ip_address   amount
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

In [ ]:
#En ciblant une colonne
df[df.duplicated(subset=['first_name','last_name'],keep=False)]

   transaction_id first_name   last_name       ip_address   amount
2      59667-0024     Florie      Prewer    148.80.11.233  $565.38
5       53942-299      Upton        Emig  103.190.123.125  $759.53
7       60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
12      68180-751     Marlon      Fernie   61.133.100.141  $974.30
14      65862-207     Alvira      Heifer   141.170.128.72  $584.13
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
16      0066-0508       Jedd     Hartman     21.55.247.91  $749.96
18     44887-2589     Sergio  Whittlesee   76.116.223.149   $346.1
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
29     43857-0134     Sergio  Whittlesee   76.116.223.149  $346.11
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

In [ ]:
### Supprimer les doublons 
df.duplicated().sum()

7

In [ ]:
df[df.duplicated(subset=['first_name','last_name'],keep=False)].sum()

transaction_id    59667-002453942-29960289-24768180-75165862-207...
first_name        FlorieUptonCorriMarlonAlviraMarlonJeddSergioUp...
last_name         PrewerEmigRockcliffeFernieHeiferFernieHartmanW...
ip_address        148.80.11.233103.190.123.12546.150.208.1861.13...
amount            $565.38$759.53$5.68$974.30$584.13$974.30$749.9...
dtype: object

In [ ]:
df.drop_duplicates().duplicated().sum()

0

In [ ]:
# autre methode :
df.drop_duplicates(subset=['transaction_id'], inplace=True)

In [ ]:
df.duplicated().sum()

0

In [ ]:
df.duplicated

<bound method DataFrame.duplicated of    transaction_id  first_name   last_name       ip_address   amount
0       50563-403      Jacobo    Haresign    18.144.134.48  $647.77
1      54569-3911     Christy        Derl  254.107.123.242  $460.47
2      59667-0024      Florie      Prewer    148.80.11.233  $565.38
3       60429-123      Danika      Shimuk   233.91.221.158  $794.76
4       0187-0771    Annelise   Antonescu   238.143.41.105  $790.41
5       53942-299       Upton        Emig  103.190.123.125  $759.53
6       41163-519     Rachael     Housley    3.188.252.248  $871.72
7       60289-247       Corri  Rockcliffe    46.150.208.18    $5.68
8       0527-1742      Ambros    Goulding   174.124.224.39  $726.12
9       57237-083        Roma     Addekin     37.14.63.174  $526.89
10      60758-060     Auberon       Boxen     168.0.223.98  $309.65
11     43857-0289      Cesare   Andriolli    244.204.3.163  $746.23
12      68180-751      Marlon      Fernie   61.133.100.141  $974.30
13      43319-040   Gavrielle      Vittet    180.20.70.166  $994.20
14      65862-207      Alvira      Heifer   141.170.128.72  $584.13
16      0066-0508        Jedd     Hartman     21.55.247.91  $749.96
17      0187-5102        Beth     Lamping    125.152.40.91   $19.07
18     44887-2589      Sergio  Whittlesee   76.116.223.149   $346.1
21      42549-609      Candra    Josowitz  158.206.200.105  $443.87
22      49999-065       Gunar        Enga     89.51.64.220   $62.60
23      52125-412  Constancia    Emberson     58.64.16.173  $666.13
24      64679-982     Felicle   Cappleman  246.127.246.202  $208.91
25      59779-556    Bartlett   Thrussell   213.80.235.219  $592.77
26      0093-1078     Wilhelm   Glanister   126.158.69.199  $722.42
27     54569-1444      Ivette     Michele      134.85.3.31  $962.30
29     43857-0134      Sergio  Whittlesee   76.116.223.149  $346.11
30      0378-2920    Shaylynn   Dominighi   105.104.251.83  $253.56
31     63629-3378      Leonid      Polino    68.183.173.70  $310.88
33      11673-003       Leroy  Stephenson     143.46.85.46  $951.73
34      60429-624     Glennis    Gianelli    48.90.168.126  $987.16
35     54973-0611       Brody      Goburn    142.230.225.8  $663.04
36     75949-1001      Madlin   Gotcliffe    45.31.218.244  $442.30
38      53746-191        Amil    O'Hannay     216.93.89.14  $520.86
39      42254-131   Inglebert     Houlson   102.102.146.27  $685.97
40      0904-6088         Ann     Cowling    113.27.40.144  $408.82
41      46122-023       Lloyd     Colliss     81.0.211.235  $225.69
43      0456-2212      Layney    Janssens     79.49.30.228  $889.27
44      59779-276    Lynnelle     Ainslie      38.85.34.83  $473.65
45      68712-049     Phaedra     Teodoro     92.45.204.14  $445.56
46     10157-9539     Sibylla      Pedron   207.112.216.80  $362.15
47      0378-1044    Sharlene  Wolfendale   32.253.106.253  $133.98>

In [ ]:
fp='https://bit.ly/missing-values'
print(fp)

https://bit.ly/missing-values

In [ ]:
df=pd.read_csv(fp)
df.head()

  color  rating
0   NaN    1.16
1   Red     NaN
2  Blue    2.54
3   Red    1.51
4   Red     NaN

In [ ]:
import numpy as np

In [ ]:
df.isna().sum()

color     129
rating    256
dtype: int64

In [ ]:
df.isna().mean()

color     0.140676
rating    0.279171
dtype: float64

In [ ]:
df['color'].value_counts(dropna=False)

Blue      323
Red       234
Orange    154
NaN       129
Yellow     77
Name: color, dtype: int64

In [ ]:
df['rating'].value_counts(dropna=False)

NaN     256
3.17      7
2.73      5
3.57      5
2.97      5
       ...
1.44      1
1.49      1
2.61      1
2.62      1
1.83      1
Name: rating, Length: 342, dtype: int64

In [ ]:
fp='https://bit.ly/missing-values-toy'
print(fp)

https://bit.ly/missing-values-toy

In [ ]:
df=pd.read_csv(fp)
df.head()

  Colonne Importante  Colonne Inutile  Colonne Peu Utile
0                Oui              NaN                2.0
1                Non              1.0                NaN
2         Légerement              NaN                3.0
3                NaN              1.0                NaN
4                Oui              1.0                4.0

In [ ]:
df['color'].isna()

0       True
1      False
2      False
3      False
4      False
       ...
912    False
913    False
914     True
915    False
916    False
Name: color, Length: 917, dtype: bool

In [ ]:
df['color_missing']=df['color'].isna()
df.head()

  color  rating  color_missing
0   NaN    1.16           True
1   Red     NaN          False
2  Blue    2.54          False
3   Red    1.51          False
4   Red     NaN          False

In [ ]:
df['rating_missing']=df['rating'].isna()
df.head()

  color  rating  color_missing  rating_missing
0   NaN    1.16           True           False
1   Red     NaN          False            True
2  Blue    2.54          False           False
3   Red    1.51          False           False
4   Red     NaN          False            True

In [ ]:
df.drop(['color_missing','rating_missing'],axis=1, inplace=True)

In [ ]:
df

      color  rating
0       NaN    1.16
1       Red     NaN
2      Blue    2.54
3       Red    1.51
4       Red     NaN
..      ...     ...
912    Blue    3.40
913     Red     NaN
914     NaN    1.24
915  Yellow    2.64
916    Blue     NaN

[917 rows x 2 columns]

In [ ]:
for col_name in df.columns:
  print(col_name)

color
rating

In [ ]:
for col_name in df.columns:
  df[col_name+'missing']=df[col_name].isna()
df.head()

  color  rating  colormissing  ratingmissing
0   NaN    1.16          True          False
1   Red     NaN         False           True
2  Blue    2.54         False          False
3   Red    1.51         False          False
4   Red     NaN         False           True

In [ ]:
df['color'].value_counts(dropna=False)

Blue      323
Red       234
Orange    154
NaN       129
Yellow     77
Name: color, dtype: int64

In [ ]:
df['color'].fillna('Blue')

0        Blue
1         Red
2        Blue
3         Red
4         Red
        ...
912      Blue
913       Red
914      Blue
915    Yellow
916      Blue
Name: color, Length: 917, dtype: object

# Variables dummy

In [ ]:
fp='https://bit.ly/dummy-variables'
print(fp)

https://bit.ly/dummy-variables

In [ ]:
import pandas as pd
df=pd.read_csv(fp)
df.head()

  color  premium
0  Blue    False
1  Blue     True
2   Red    False
3   Red    False
4  Blue    False

In [ ]:
df['color'].value_counts(dropna=False)

Blue      364
Red       327
Orange    197
Yellow    112
Name: color, dtype: int64

In [ ]:
df['premium'].value_counts(dropna=False)

False    520
True     480
Name: premium, dtype: int64

In [ ]:
df['premium'].head()

0    False
1     True
2    False
3    False
4    False
Name: premium, dtype: bool

In [ ]:
df['premium'].astype(int)

0      0
1      1
2      0
3      0
4      0
      ..
995    0
996    1
997    0
998    0
999    1
Name: premium, Length: 1000, dtype: int64

In [ ]:
df['color']=df['color'].astype('category')

In [ ]:
df['color'].cat.codes

0      0
1      0
2      2
3      2
4      0
      ..
995    1
996    0
997    2
998    0
999    0
Length: 1000, dtype: int8

In [ ]:
df['color_base_enc']=df['color'].cat.codes

In [ ]:
df['premium_base_enc']=df['premium'].astype(int)
df.head()

  color  premium  premium_base_enc  color_base_enc
0  Blue    False                 0               0
1  Blue     True                 1               0
2   Red    False                 0               2
3   Red    False                 0               2
4  Blue    False                 0               0

### One HOT encoding

In [ ]:
(df['color']=='Red').astype(int)

0      0
1      0
2      1
3      1
4      0
      ..
995    0
996    0
997    1
998    0
999    0
Name: color, Length: 1000, dtype: int64

In [ ]:
df['color_red']=(df['color']=='Red').astype(int)
df['color_Blue']=(df['color']=='Blue').astype(int)
df['color_Yellow']=(df['color']=='Yellow').astype(int)
df['color_Orange']=(df['color']=='Orange').astype(int)
df.head()

  color  premium  premium_base_enc  ...  color_Blue  color_Yellow  color_Orange
0  Blue    False                 0  ...           1             0             0
1  Blue     True                 1  ...           1             0             0
2   Red    False                 0  ...           0             0             0
3   Red    False                 0  ...           0             0             0
4  Blue    False                 0  ...           1             0             0

[5 rows x 8 columns]

In [ ]:
pd.get_dummies(df['color'])

     Blue  Orange  Red  Yellow
0       1       0    0       0
1       1       0    0       0
2       0       0    1       0
3       0       0    1       0
4       1       0    0       0
..    ...     ...  ...     ...
995     0       1    0       0
996     1       0    0       0
997     0       0    1       0
998     1       0    0       0
999     1       0    0       0

[1000 rows x 4 columns]

In [ ]:
pd.get_dummies?

In [ ]:
pd.get_dummies(df['color'],drop_first=True)

     Orange  Red  Yellow
0         0    0       0
1         0    0       0
2         0    1       0
3         0    1       0
4         0    0       0
..      ...  ...     ...
995       1    0       0
996       0    0       0
997       0    1       0
998       0    0       0
999       0    0       0

[1000 rows x 3 columns]

In [ ]:
df=pd.read_csv(fp)
df.head()

  color  premium
0  Blue    False
1  Blue     True
2   Red    False
3   Red    False
4  Blue    False

In [ ]:
dummies=pd.get_dummies(df['color'])
dummies.head()

   Blue  Orange  Red  Yellow
0     1       0    0       0
1     1       0    0       0
2     0       0    1       0
3     0       0    1       0
4     1       0    0       0

In [ ]:
df=pd.concat([df,dummies],axis=1)
df.head()

  color  premium  Blue  Orange  Red  Yellow
0  Blue    False     1       0    0       0
1  Blue     True     1       0    0       0
2   Red    False     0       0    1       0
3   Red    False     0       0    1       0
4  Blue    False     1       0    0       0

In [ ]:
df['premium_base_enc']=df['premium'].astype(int)
df.head()

  color  premium  Blue  Orange  Red  Yellow  premium_base_enc
0  Blue    False     1       0    0       0                 0
1  Blue     True     1       0    0       0                 1
2   Red    False     0       0    1       0                 0
3   Red    False     0       0    1       0                 0
4  Blue    False     1       0    0       0                 0

In [ ]:
pd.get_dummies(df['color'],drop_first=True)

In [ ]:
df.to_csv('fichier.csv')

In [2]:
import random

In [3]:
random.seed(123)

# Split Train /
### Test / Valid" stratifiées

In [4]:
import pandas as pd
from random import randint
from random import seed

In [5]:
seed(1)
col_1=[randint(-10,10) for _ in range(10)]
col_2=[randint(-20,-5) for _ in range(10)]
col_Y=[randint(1,2) for _ in range(10)]

In [7]:
df=pd.DataFrame(data={'x1':col_1,
                      'x2':col_2,
                      'y':col_Y})
df

   x1  x2  y
0  -6 -14  1
1   8 -17  2
2  -8  -5  1
3  -2 -20  1
4  -7  -8  1
5   5  -7  1
6   4 -20  2
7   5  -6  1
8  10 -12  2
9   2 -13  1

In [14]:
train_df=df.sample(frac=0.8,random_state=1)
train_df

   x1  x2  y
2  -8  -5  1
9   2 -13  1
6   4 -20  2
4  -7  -8  1
0  -6 -14  1
3  -2 -20  1
1   8 -17  2
7   5  -6  1

In [11]:
train_df.index

Int64Index([2, 9, 6, 4, 0, 3, 1, 7], dtype='int64')

In [13]:
test_df=df.sample(frac=0.2,random_state=1)
test_df

   x1  x2  y
2  -8  -5  1
9   2 -13  1

In [15]:
test_df.index.isin(train_df.index)

array([ True,  True])

In [16]:
df.index.isin(train_df.index)

array([ True,  True,  True,  True,  True, False,  True,  True, False,
        True])

In [17]:
~df.index.isin(train_df.index)

array([False, False, False, False, False,  True, False, False,  True,
       False])

In [18]:
not_in_train_set=~df.index.isin(train_df.index)

In [20]:
train_df=df[not_in_train_set]
train_df

   x1  x2  y
5   5  -7  1
8  10 -12  2

In [21]:
#Sélection stratifiée
train_1=df[df['y']==1].sample(frac=0.8,random_state=1)
train_1

   x1  x2  y
9   2 -13  1
3  -2 -20  1
2  -8  -5  1
0  -6 -14  1
5   5  -7  1
4  -7  -8  1

In [22]:
train_2=df[df['y']==2].sample(frac=0.8,random_state=1)
train_2

   x1  x2  y
1   8 -17  2
8  10 -12  2

In [24]:
train_df=pd.concat([train_1,train_2], axis=0)
train_df

   x1  x2  y
9   2 -13  1
3  -2 -20  1
2  -8  -5  1
0  -6 -14  1
5   5  -7  1
4  -7  -8  1
1   8 -17  2
8  10 -12  2

In [25]:
not_in_train=~df.index.isin(train_df.index)

test_df=df[not_in_train]
test_df

   x1  x2  y
6   4 -20  2
7   5  -6  1

In [26]:
df['y'].unique()

array([1, 2])

In [28]:
#Automatiser

#Créer un data set stratifié d'entrainement
train_parts=[]
for value in df['y'].unique():
  tmp=df[df['y']==value]
  part=tmp.sample(frac=0.8,
                  random_state=1)
  train_parts.append(part)
train_df=pd.concat(train_parts,
                   axis=0)

#Identifier les index qui ne sont pas dans le train set 
not_in_train=~df.index.isin(train_df.index)

#On crée le test set par complément
test_set=df[not_in_train]

In [29]:
def stratified_split(df,col_y,frac=0.8,
                     random_state=1):
    #Créer un data set stratifié d'entrainement
  train_parts=[]
  for value in df[col_y].unique():
    tmp=df[df[col_y]==value]
    part=tmp.sample(frac=frac,
                    random_state=random_state)
    train_parts.append(part)
  train_df=pd.concat(train_parts,
                     axis=0)

  #Identifier les index qui ne sont pas dans le train set 
  not_in_train=~df.index.isin(train_df.index)

  #On crée le test set par complément
  test_df=df[not_in_train]

  return train_df, test_df

In [30]:
train_df, test_df=stratified_split(df,'y')

In [31]:
train_df, valid_df=stratified_split(train_df,'y')

In [32]:
train_df, test_df ,valid_df

(   x1  x2  y
 2  -8  -5  1
 3  -2 -20  1
 5   5  -7  1
 9   2 -13  1
 0  -6 -14  1
 1   8 -17  2
 8  10 -12  2,    x1  x2  y
 6   4 -20  2
 7   5  -6  1,    x1  x2  y
 4  -7  -8  1)

In [33]:
train_df.to_csv('train.csv',index=None) 

test_df.to_csv('test.csv',index=None)

valid_df.to_csv('valit.csv',index=None)

# Isoler la variable cible

In [47]:
Y=train_df['y']
X=train_df.drop('y', axis=1)

In [48]:
Y.head()

2    1
3    1
5    1
9    1
0    1
Name: y, dtype: int64

In [49]:
X.head()

   x1  x2
2  -8  -5
3  -2 -20
5   5  -7
9   2 -13
0  -6 -14

In [54]:
def isolate(df, col_y):
  Y=train_df['y']
  X=train_df.drop('y', axis=1)
  return X,Y

In [55]:
train_X, train_Y=isolate(train_df,col_y='y')

In [56]:
train_X.head()

   x1  x2
2  -8  -5
3  -2 -20
5   5  -7
9   2 -13
0  -6 -14

In [57]:
train_Y.head()

2    1
3    1
5    1
9    1
0    1
Name: y, dtype: int64

In [58]:
from sklearn.utils import shuffle

train_X, train_Y=shuffle(train_X, train_Y,random_state=0)

In [59]:
train_Y.head()

8    2
5    1
3    1
9    1
2    1
Name: y, dtype: int64

In [60]:
train_X.head()

   x1  x2
8  10 -12
5   5  -7
3  -2 -20
9   2 -13
2  -8  -5

# Entrainement

In [63]:
data1='https://bit.ly/vintage-auctions'
print(data1)

df1=pd.read_csv(data1)
df1.head()

https://bit.ly/vintage-auctions

                                      tx id      time  ... shirt size   condition
0  8dbf3cfa48b25f32e300f279bb4163c67d5c60cd   3:36 PM  ...          S        used
1  8ccebfdb1a41830bdcc0e926531f3215986b3a90   9:03 AM  ...          L  never worn
2  ae85a421a91cec8baf16ff1e45fb3e239130b584   7:42 PM  ...          L        used
3  85e44f09a04a79182befcfd55e288a855f633e81  10:28 PM  ...         XS         NaN
4  ff750bfca4910cfa7f538fbe5463457839021680   6:38 AM  ...        2XL        used

[5 rows x 6 columns]

In [76]:
df1.dtypes

tx id         object
time          object
auction       object
color         object
shirt size    object
condition     object
dtype: object

In [77]:
df1.tail()

                                        tx id      time  ... shirt size condition
995  6fa16b110f53367cf15e6e1dcffdcb4c2653f1ab   9:56 AM  ...        2XL       NaN
996  2b7b6cbc2224502c7137262575e97a450b336fc2  11:31 AM  ...          S      Used
997  7f2a5141de8a7f752f8f98722393ffa3b0fb1e7a   6:25 AM  ...         XS      used
998  c4549687dee4d3061fd3c82433367bea083d4d05   2:22 AM  ...          L      Used
999  abf227d09fe37b3e333b419e0854c6c2fd1caa50   7:47 PM  ...         XL      used

[5 rows x 6 columns]

### Ennoncé :
#### Extraire les prix de la colonne action
#### Créer une colonne time_cat contenant 6 categories
##### 1. Nuit 1h--6h29
##### 2. Matin 6h30--11h59
##### 3. Midi 12h--13h59
##### 4. Après midi 14h--17h59
##### 5. Afterwork 18h--20h59
##### 6. Soir 21h--00h59
#### Encoder toures les variables categorielles 
#### Droper les colonnes time, tx_id et toutes les colonnes redondantes
#### Split train/test/valid, stratifié par rapport à la colonne time_cat
#### Isoler la variable cible qui est le montant de l'auction 
#### Sauvegarder les trois dataset dans 3 csv

In [70]:
import pandas as pd

data2='https://bit.ly/diamonds-data'
print(data2)

df2=pd.read_csv(data2)
df2.head()

https://bit.ly/diamonds-data

   Unnamed: 0  carat      cut color clarity  ...  table  price     x     y     z
0           1   0.23    Ideal     E     SI2  ...   55.0    326  3.95  3.98  2.43
1           2   0.21  Premium     E     SI1  ...   61.0    326  3.89  3.84  2.31
2           3   0.23     Good     E     VS1  ...   65.0    327  4.05  4.07  2.31
3           4   0.29  Premium     I     VS2  ...   58.0    334  4.20  4.23  2.63
4           5   0.31     Good     J     SI2  ...   58.0    335  4.34  4.35  2.75

[5 rows x 11 columns]

In [67]:
import pandas as pd

data3='https://bit.ly/titanic-train-set'
print(data3)

df3=pd.read_csv(data3)
df3.head()

https://bit.ly/titanic-train-set

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [68]:
import pandas as pd

data4='https://bit.ly/titanic-test-set'
print(data4)

df4=pd.read_csv(data4)
df4.head()

https://bit.ly/titanic-test-set

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]